Revit 2024 API
LineLightShape Constructor
Overload List
Name | Description
LineLightShape()
 Creates a line light shape object with 2.0' emit length.
LineLightShape(Double)
 Creates a line light shape object with the given emit length.
LineLightShape(LineLightShape)
 Creates a copy of the given line light shape
See Also
LineLightShape Class
LineLightShape Members
Autodesk.Revit.DB.Lighting Namespace